Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Also, the Keycloak page offers an option to `Sign In To Keycloak To Configure Realms` by using a *Keycloak Admin* option in the right top corner:
ja_jp: また、Keycloak ページには、右上隅にある *Keycloak Admin* オプションを使用して、Keycloak にサインインしてレルムを設定するオプション (`Sign In To Keycloak To Configure Realms`) があります。

source: Also, the Keycloak page offers an option to `Sign In To Keycloak To Configure Realms` using a `Keycloak Admin` option in the right top corner:
ja_jp: また、Keycloak ページには、右上隅にある `KeycloakAdmin` オプションを使用して、Keycloak にサインインしてレルムを設定 (`SignIn To Keycloak To Configure Realms`) するオプションがあります。

source: Also, the `name` field represents a Cassandra partition key, and so we are annotating it with `@PartitionKey` – another annotation from the Object Mapper library.
ja_jp: また、 `name` フィールドは Cassandra パーティションキーを表すため、ObjectMapper ライブラリーの別のアノテーションである `@PartitionKey` のアノテーションを付けています。

source: Also, the import process only runs if the database is empty (no key). You can force to import even if there is data using the `quarkus.redis.load-only-if-empty=false`
ja_jp: また、インポート処理は、データベースが空（キーなし）の場合のみ実行されます。 `quarkus.redis.load-only-if-empty=false` を使用すれば、データがあっても強制的にインポートすることができます。

source: Also, the return type for `getMetaData()` must be defined (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java`):
ja_jp: また、 `getMetaData()` の戻り値の型を定義する必要があります ( `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java` ):

source: Also, the service account "my-service-account" will be generated.
ja_jp: また、サービスアカウント "my-service-account" が生成されます。

source: Also, there is a reactive flavor of `ClientHeadersFactory` that allows doing blocking operations. For example:
ja_jp: また、ブロッキング操作を実行できる `ClientHeadersFactory` のリアクティブフレーバーがあります。例えば:

source: Also, using Flyway to migrate your schema when starting the application will modify the database data on your Docker hosts's file system.
ja_jp: また、アプリケーションの起動時にFlywayを使用してスキーマを移行すると、Docker hostsのファイルシステム上のデータベースデータが変更されます。

source: Also, using Quarkus REST (formerly RESTEasy Reactive), our default REST layer, does not require the use of Hibernate Reactive. It is perfectly valid to use Quarkus REST with Hibernate ORM, and if you do not need high-concurrency, or are not accustomed to the reactive paradigm, it is recommended to use Hibernate ORM.
ja_jp: また、デフォルトのRESTレイヤであるQuarkus REST（旧RESTEasy Reactive）を使用する場合、Hibernate Reactiveを使用する必要はありません。 Quarkus RESTとHibernate ORMを併用することはまったく問題ありません。 高い同時性が必要ない場合やリアクティブパラダイムに慣れていない場合は、Hibernate ORMを使用することをお勧めします。

source: Also, using RESTEasy Reactive, our default REST layer, does not require the use of Hibernate Reactive. It is perfectly valid to use RESTEasy Reactive with Hibernate ORM, and if you do not need high-concurrency, or are not accustomed to the reactive paradigm, it is recommended to use Hibernate ORM.
ja_jp: また、デフォルトのRESTレイヤであるRESTEasy Reactiveを使用する場合、Hibernate Reactiveを使用することは必須ではありません。 RESTEasy ReactiveをHibernate ORMで使用することはまったく問題ありません。 高い同時性が必要でない場合やリアクティブパラダイムに慣れていない場合は、Hibernate ORMを使用することをお勧めします。

source: Also, we only publish the `quarkus-bom` for non-Final releases so make sure you use this BOM and not the `quarkus-universe-bom` for testing.
ja_jp: また、最終版以外のリリースでは `quarkus-bom` のみを公開していますので、テスト用には `quarkus-universe-bom` ではなく、このBOMを使用してください。

source: Also, when running multiple copies of the same application (in a cluster, for example on Kubernetes/OpenShift), caches in separate copies of the application aren't synchronized.
ja_jp: また、同じアプリケーションの複数のコピーを（Kubernetes/OpenShiftなどのクラスタで）実行している場合、アプリケーションの別々のコピーのキャッシュは同期されません。

source: Also, you can configure the lookup timeout using:
ja_jp: また、ルックアップのタイムアウトは、以下の方法で設定できます。

source: Alter the client to make calls with the `extraHeaders` attached
ja_jp: `extraHeaders` を付加して呼び出しができるようにクライアントを変更します。

source: Altering the test class
ja_jp: テストクラスの変更

source: Alternately, you can also return a <<reactive,reactive type>> such as link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`], link:{mutinyapi}/io/smallrye/mutiny/Multi.html[`Multi`] or link:{jdkapi}/java/util/concurrent/CompletionStage.html[`CompletionStage`] that resolve to one of the mentioned return types.
ja_jp: あるいは、link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`]、link:{mutinyapi}/io/smallrye/mutiny/Multi.html[`Multi`] または link:{jdkapi}/java/util/concurrent/CompletionStage.html[`CompletionStage`] など、前述の戻り値の型に対して解決して、<<reactive,reactive type>> を返すことも可能です。

source: Alternately, you can also return a xref:reactive[reactive type] such as link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`], link:{mutinyapi}/io/smallrye/mutiny/Multi.html[`Multi`] or link:{jdkapi}/java/util/concurrent/CompletionStage.html[`CompletionStage`] that resolve to one of the mentioned return types.
ja_jp: また、次のような xref:reactive[リアクティブ型] を返すこともできます: link:{mutinyapi}/io/smallrye/mutiny/Uni.html[Uni] , link:{mutinyapi}/io/smallrye/mutiny/Multi.html[Multi] あるいは link:{jdkapi}/java/util/concurrent/CompletionStage.html[CompletionStage] のように、言及された戻り値の型のいずれかに解決されるもの。

source: Alternately, you can create an extension of the `KubernetesServerTestResource` class to ensure all your `@QuarkusTest` enabled test classes share the same mock server setup via the `QuarkusTestResource` annotation:
ja_jp: または、 `KubernetesServerTestResource`クラスの拡張を作成して、 ` @ QuarkusTest`が有効なすべてのテストクラスが `QuarkusTestResource`アノテーションを介して同じモックサーバーセットアップを共有するようにすることもできます。

source: Alternately, you can use `@HQL` or `@SQL` queries, which support HQL and SQL queries. Once again the Hibernate documentation has https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#generated-query-methods[all the information you need].
ja_jp: あるいは、HQL および SQL クエリをサポートする `@HQL` または `@SQL` クエリを使用できます。繰り返しになりますが、Hibernate ドキュメントには https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#generated-query-methods[必要なすべての情報] があります。

source: Alternative - Using ubi-minimal
ja_jp: 代替 - ubi-minimalを使用する

source: Alternative 1: Apply a security annotation to the calling method in your REST layer:
ja_jp: 代替案 1: REST レイヤーの呼び出し元メソッドにセキュリティーアノテーションを適用する。

source: Alternative 2: Replace the type variable `T` with a concrete type in the repository interface:
ja_jp: 代替案 2: リポジトリーインターフェースの型変数 `T` を具体的な型に置き換える。

source: Alternative Console Logging Formats
ja_jp: コンソールログの代替フォーマット

source: Alternative Languages
ja_jp: 代替言語

source: Alternative console logging formats
ja_jp: コンソール・ロギングの代替フォーマット

source: Alternative languages
ja_jp: 代替言語

source: Alternative to the trace output, it is possible to configure the native image agent with an experimental flag that shows the origins of the configuration entries. You can enable that with the following additional system property:
ja_jp: トレース出力の代わりとして、 設定エントリーの出どころを示す実験的なフラグを使用してネイティブイメージエージェントを設定できます。 次の追加のシステムプロパティーを使用して、このエージェントを有効にできます。

source: Alternatively or additionally to an interceptor, you can enrich *all* your `@QuarkusTest` classes by implementing the following callback interfaces:
ja_jp: インターセプターの代わりに、あるいはインターセプターに加えて、以下のコールバックインターフェースを実装することで、 *すべての* `@QuarkusTest` クラスを充実させることができます。

source: Alternatively to using Quarkus code generation to generate stubs for `proto` files, you can also use `protobuf-maven-plugin`.
ja_jp: Quarkusのコード生成を使用して `proto` ファイルのスタブを生成する代わりに、 `protobuf-maven-plugin` を使うこともできます。

source: Alternatively to using the `generate-code` goal of the `quarkus-maven-plugin`, you can use `protobuf-maven-plugin` to generate these files, more in <<Generating Java files from proto with protobuf-maven-plugin>>
ja_jp: `quarkus-maven-plugin` の `generate-code` ゴールを使用する代わりに、 `protobuf-maven-plugin` を使用してこれらのファイルを生成することができます。詳細は <<protoファイルからprotobuf-maven-pluginでJavaファイルを生成する>> を参照してください。

source: Alternatively to using the `generate-code` goal of the `quarkus-maven-plugin`, you can use `protobuf-maven-plugin` to generate these files. See the xref:protobuf-maven-plugin[Generating Java files from proto with protobuf-maven-plugin] section for more information.
ja_jp: `quarkus-maven-plugin` の `generate-code` ゴールを使用する代わりに、これらのファイルを生成するために `protobuf-maven-plugin` を使用することができます。詳細については、 xref:protobuf-maven-plugin[protobuf-maven-pluginを使用したprotoからのJavaファイルの生成] セクションを参照してください。

source: Alternatively you can configure the authentication programmatically:
ja_jp: または、プログラムで認証を設定することもできます。

source: Alternatively you can configure the tenant `tenant-a` directly in `application.properties`:
ja_jp: または、 `application.properties` で直接テナント `tenant-a` を設定することもできます：

source: Alternatively you can still use the old DRL syntax, specifying the name of the data source as an entry-point, with the drawback that in this case you need to specify again the type of the matched object, even if the engine can infer it from the type of the datasource, as it follows.
ja_jp: または、データソースの名前をエントリーポイントとして指定する古い DRL 構文を使用することもできますが、この場合、エンジンがデータソースのタイプから推測できる場合でも、一致するオブジェクトのタイプを再度指定する必要があるという欠点があります。

source: Alternatively you can use `smallrye.jwt.new-token.key-encryption-algorithm` and `smallrye.jwt.new-token.content-encryption-algorithm` properties to customize the key and content encryption algorithms:
ja_jp: また、 `smallrye.jwt.new-token.key-encryption-algorithm` と `smallrye.jwt.new-token.content-encryption-algorithm` のプロパティでキーとコンテンツの暗号化アルゴリズムをカスタマイズすることが可能です。

source: Alternatively you can use a `smallrye.jwt.new-token.signature-algorithm` property:
ja_jp: または、 `smallrye.jwt.new-token.signature-algorithm` プロパティーを使用することもできます:

source: Alternatively, `AccessTokenRequestFilter` can be registered automatically with all MP Rest or JAX-RS clients if `quarkus.oidc-token-propagation.register-filter` property is set to `true` and `quarkus.oidc-token-propagation.json-web-token` property is set to `false` (which is a default value).
ja_jp: または、 `quarkus.oidc-token-propagation.register-filter` プロパティが `true` に設定され、 `quarkus.oidc-token-propagation.json-web-token` プロパティが `false` に設定されている場合（デフォルト値です）、すべての MP Rest または JAX-RS クライアントで `AccessTokenRequestFilter` を自動的に登録することができます。

source: Alternatively, `AccessTokenRequestFilter` can be registered automatically with all MP Rest or Jakarta REST clients if the `quarkus.oidc-token-propagation.register-filter` property is set to `true` and `quarkus.oidc-token-propagation.json-web-token` property is set to `false` (which is a default value).
ja_jp: または、 `quarkus.oidc-token-propagation.register-filter` プロパティが `true` に設定され、 `quarkus.oidc-token-propagation.json-web-token` プロパティが `false` に設定されている場合（デフォルト値です）、すべての MP Rest または Jakarta REST クライアントで `AccessTokenRequestFilter` を自動的に登録することができます。

source: Alternatively, `AccessTokenRequestFilter` can be registered automatically with all MP Rest or Jakarta REST clients if the `quarkus.resteasy-client-oidc-token-propagation.register-filter` property is set to `true` and `quarkus.resteasy-client-oidc-token-propagation.json-web-token` property is set to `false` (which is a default value).
ja_jp: または、 `quarkus.resteasy-client-oidc-token-propagation.register-filter` プロパティーが `true` に設定され、 `quarkus.resteasy-client-oidc-token-propagation.json-web-token` プロパティーが `false` (デフォルト値) に設定されている場合、 `AccessTokenRequestFilter` はすべての MP Rest または Jakarta REST クライアントに自動的に登録されます。

source: Alternatively, `AccessTokenRequestFilter` can be registered automatically with all MP Rest or Jakarta REST clients if the `quarkus.resteasy-client-oidc-token-propagation.register-filter` property is set to `true` and the `quarkus.resteasy-client-oidc-token-propagation.json-web-token` property is set to `false`, which is the default value.
ja_jp: あるいは、 `quarkus.resteasy-client-oidc-token-propagation.register-filter` プロパティーが `true` に設定され、 `quarkus.resteasy-client-oidc-token-propagation.json-web-token` プロパティーがデフォルト値である `false` に設定されている場合、`AccessTokenRequestFilter` はすべての MP Rest または Jakarta REST クライアントに自動的に登録できます。

source: Alternatively, `JsonWebTokenRequestFilter` can be registered automatically with all MP Rest or JAX-RS clients if both `quarkus.oidc-token-propagation.register-filter` and `quarkus.oidc-token-propagation.json-web-token` properties are set to `true`.
ja_jp: または、 `quarkus.oidc-token-propagation.register-filter` プロパティーおよび `quarkus.oidc-token-propagation.json-web-token` プロパティーの両方が `true` に設定されている場合、 `JsonWebTokenRequestFilter` は、すべての MP Rest または JAX-RS クライアントで自動的に登録することができます。

source: Alternatively, `JsonWebTokenRequestFilter` can be registered automatically with all MicroProfile REST or Jakarta REST clients if both `quarkus.oidc-token-propagation.register-filter` and `quarkus.oidc-token-propagation.json-web-token` properties are set to `true`.
ja_jp: あるいは、 `quarkus.oidc-token-propagation.register-filter` と `quarkus.oidc-token-propagation.json-web-token` の両方のプロパティを `true` に設定すると、すべての MicroProfile REST または Jakarta REST クライアントで `JsonWebTokenRequestFilter` が自動的に登録されます。

source: Alternatively, `JsonWebTokenRequestFilter` can be registered automatically with all MicroProfile REST or Jakarta REST clients if both `quarkus.resteasy-client-oidc-token-propagation.register-filter` and `quarkus.resteasy-client-oidc-token-propagation.json-web-token` properties are set to `true`.
ja_jp: または、 `quarkus.resteasy-client-oidc-token-propagation.register-filter` プロパティーと `quarkus.resteasy-client-oidc-token-propagation.json-web-token` プロパティーの両方が `true` に設定されている場合、 `JsonWebTokenRequestFilter` はすべての MicroProfile REST または Jakarta REST クライアントに自動的に登録できます。

source: Alternatively, `JsonWebTokenRequestFilter` can be registered automatically with all MicroProfile REST or Jakarta REST clients if both the `quarkus.resteasy-client-oidc-token-propagation.register-filter` and `quarkus.resteasy-client-oidc-token-propagation.json-web-token` properties are set to `true`.
ja_jp: あるいは、`quarkus.resteasy-client-oidc-token-propagation.register-filter` と `quarkus.resteasy-client-oidc-token-propagation.json-web-token` の両方のプロパティーが `true` に設定されている場合、`JsonWebTokenRequestFilter` はすべての MicroProfile REST または Jakarta REST クライアントに自動的に登録できます。

source: Alternatively, `OidcClientRequestFilter` can be registered automatically with all MP Rest or JAX-RS clients if `quarkus.oidc-client-filter.register-filter=true` property is set.
ja_jp: または、 `quarkus.oidc-client-filter.register-filter=true` プロパティーが設定されている場合、すべての MP Rest または JAX-RS クライアントで `OidcClientRequestFilter` を自動的に登録することができます。

source: Alternatively, `OidcClientRequestFilter` can be registered automatically with all MP Rest or Jakarta REST clients if `quarkus.oidc-client-filter.register-filter=true` property is set.
ja_jp: あるいは、 `quarkus.oidc-client-filter.register-filter=true` プロパティが設定されている場合、すべての MP Rest または Jakarta REST クライアントで `OidcClientRequestFilter` を自動的に登録することもできます。

source: Alternatively, `OidcClientRequestFilter` can be registered automatically with all MP Rest or Jakarta REST clients if the `quarkus.resteasy-client-oidc-filter.register-filter=true` property is set.
ja_jp: あるいは、 `quarkus.resteasy-client-oidc-filter.register-filter=true` プロパティーが設定されている場合、すべての MP Rest または Jakarta REST クライアントで `OidcClientRequestFilter` を自動的に登録することもできます。

source: Alternatively, add the following dependency to your project:
ja_jp: あるいは、以下の依存関係をプロジェクトに追加してください：

source: Alternatively, add these entries to your `application.properties`:
ja_jp: または、これらのエントリを `application.properties` に追加します:

source: Alternatively, allow the same unsafe behavior but with warnings when it occurs:
ja_jp: あるいは、同じように安全でない動作を許可しますが、その際には警告を表示します：

source: Alternatively, an approach native to the build system may be used. In Maven, that is the `-Dtest=\...` system property, while in Gradle, it is the `--tests \...` command line option. These options, when used with `maven quarkus:[dev|test]` or `gradle quarkus[Dev|Test]`, work just like they work with `mvn test` or `gradle test`, except that they filter the set of tests executed during continuous testing. When these options are used, the `quarkus.test.[include|exclude]-pattern` configuration is ignored.
ja_jp: あるいは、ビルドシステム固有のアプローチを使用することもできます。 Maven では `-Dtest=...` システムプロパティ、Gradle では `--tests ...` コマンドラインオプションです。 これらのオプションは、 `maven quarkus:[dev|test]` または `gradle quarkus[Dev|Test]` と一緒に使用すると、 `mvn test` または `gradle test` と同じように動作します。 これらのオプションを使用すると、 `quarkus.test.[include|exclude]-pattern` の設定は無視されます。

source: Alternatively, application code can override the `io.fabric8.kubernetes.client.Config` or even the `io.fabric8.kubernetes.client.KubernetesClient` bean (which are normally provided by the extension) by simply declaring custom versions of those beans.
ja_jp: あるいは，アプリケーションコードは，単にそれらのBeanのカスタムバージョンを宣言することによって，（通常エクステンションによって提供される） `io.fabric8.kubernetes.client.Config` ，あるいは `io.fabric8.kubernetes.client.KubernetesClient` Beanをオーバーライドすることもできます。

source: Alternatively, continuous testing and publication can be handled manually.
ja_jp: または、継続的テストと公開を手動で処理することも可能です。

source: Alternatively, define a xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI bean producer] for the default datasource. The bean producer redirects to the active named datasource. The application can then inject the default datasource directly, as shown below:
ja_jp: あるいは、デフォルトのデータソース用に xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI Bean プロデューサー] を定義します。 この Bean プロデューサーは、アクティブな名前付きデータソースにリダイレクトします。 アプリケーションは、以下のようにデフォルトのデータソースを直接注入できるようになります。

source: Alternatively, download a {quickstarts-archive-url}[Quickstarts archive]. The solution is located in the `microprofile-metrics-quickstart` link:{quickstarts-tree-url}/microprofile-metrics-quickstart[directory] and follow with the xref:running-and-using-the-application_{context}[Running and using the application] section.
ja_jp: または、{quickstarts-archive-url}[Quickstartsアーカイブ]をダウンロードしてください。ソリューションは `microprofile-metrics-quickstart` link:{quickstarts-tree-url}/microprofile-metrics-quickstart[ディレクトリ] にあり、 xref:running-and-using-the-application_{context}[アプリケーションの実行と使用] セクションに従います。

source: Alternatively, download a {quickstarts-archive-url}[Quickstarts archive]. The solution is located in the `microprofile-metrics-quickstart` link:{quickstarts-tree-url}/microprofile-metrics-quickstart[directory] and follow with the xref:running-and-using-the-application_{context}[] section.
ja_jp: または、{quickstarts-archive-url}[Quickstartsアーカイブ]をダウンロードしてください。ソリューションは `microprofile-metrics-quickstart` link:{quickstarts-tree-url}/microprofile-metrics-quickstart[ディレクトリ] に存在し、 <<running-and-using-the-application_{context}>> セクションを実施して下さい。

source: Alternatively, download a {quickstarts-archive-url}[Quickstarts archive]. The solution is located in the `microprofile-metrics-quickstart` {quickstarts-tree-url}/microprofile-metrics-quickstart[directory] and follow with the xref:running-and-using-the-application_{context}[] section.
ja_jp: または、 {quickstarts-archive-url}[Quickstarts アーカイブ] をダウンロードしてください。ソリューションは、 `microprofile-metrics-quickstart` {quickstarts-tree-url}/microprofile-metrics-quickstart[directory] にあり、 xref:running-and-using-the-application_{context}[] セクションに続きます。

source: Alternatively, generate it from the command line:
ja_jp: または、コマンドラインから生成します。

source: Alternatively, if for some reason you can't or don't want to annotate your analysis configurer with `@SearchExtension`, you can simply annotate it with `@Dependent @Named("myAnalysisConfigurer")` and then reference it from configuration properties:
ja_jp: また、何らかの理由で `@SearchExtension` アノテーションを付けられない、あるいは付けたくない場合には、単純に `@Dependent @Named("myAnalysisConfigurer")` のアノテーションを付けて設定のプロパティから参照することも可能です:

source: Alternatively, if for some reason you can't or don't want to annotate your mapping configurer with `@SearchExtension`, you can simply annotate it with `@Dependent @Named("myMappingConfigurer")` and then reference it from configuration properties:
ja_jp: または、何らかの理由で mapping configurer に `@SearchExtension` アノテーションを追加できない、または追加したくない場合は、 `@Dependent @Named("myMappingConfigurer")` アノテーションを付け、設定プロパティーから参照できます。

source: Alternatively, if the discovery endpoint is not available or you would like to save on the discovery endpoint round-trip, you can disable the discovery and configure the token endpoint address with a relative path value, for example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを節約したい場合は、ディスカバリーを無効にして、相対パス値でトークンエンドポイントアドレスを設定することもできます。例えば:

source: Alternatively, if the discovery endpoint is not available or you would like to save on the discovery endpoint roundtrip, you can disable the discovery and configure the token endpoint address with a relative path value, for example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを節約したい場合は、ディスカバリーを無効にして、トークンエンドポイントのアドレスを相対パスの値で設定することができます。例:

source: Alternatively, if the discovery endpoint is not available or you would like to save on the discovery endpoint roundtrip, you can disable the discovery and configure them with relative path values, for example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを節約したい場合は、ディスカバリーを無効にして、相対パスの値で設定することができます。

source: Alternatively, if the discovery endpoint is not available, or if you want to save on the discovery endpoint round-trip, you can disable the discovery and configure them with relative path values. For example:
ja_jp: 検出エンドポイントが利用できない場合や、検出エンドポイントのラウンドトリップのコストを節約する場合は、検出を無効にして、エンドポイントアドレスを相対パス値で設定することができます。 以下に例を示します。

source: Alternatively, if the discovery endpoint is not available, or if you would like to save on the discovery endpoint round-trip, you can disable the discovery and configure them with relative path values, for example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを節約したい場合は、ディスカバリーを無効にして、相対パスの値で設定することができます。

source: Alternatively, if the discovery endpoint is not available, or you prefer to reduce the discovery endpoint round-trip, you can disable endpoint discovery and configure relative path values, for example:
ja_jp: あるいは、ディスカバリー・エンドポイントが利用できない場合や、ディスカバリー・エンドポイントのラウンドトリップを減らしたい場合は、エンドポイントのディスカバリーを無効にし、相対パス値などを設定することもできます。例:

source: Alternatively, if the discovery endpoint is not available, or you prefer to reduce the discovery endpoint round-trip, you can disable endpoint discovery and configure relative path values. For example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを減らしたい場合は、エンドポイントのディスカバリーを無効にし、相対パス値を設定することもできます。 例:

source: Alternatively, if the discovery endpoint is unavailable or you want to avoid an extra round-trip to it, you can disable discovery and configure the token endpoint address with a relative path.
ja_jp: あるいは、ディスカバリーエンドポイントが利用できない場合や、それへの余分なラウンドトリップを避けたい場合は、ディスカバリーを無効にして、相対パスでトークンエンドポイントアドレスを設定できます。

source: Alternatively, if the discovery endpoint is unavailable or you want to save on the discovery endpoint round-trip, you can disable the discovery and configure the token endpoint address with a relative path value. For example:
ja_jp: また、ディスカバリーエンドポイントが利用できない場合や、ディスカバリーエンドポイントのラウンドトリップを回避する場合は、ディスカバリーを無効にして、相対パス値でトークンエンドポイントアドレスを設定することもできます。例:

source: Alternatively, if you don't necessarily need to hold state during the transaction, and just want to react to transaction start/end events, you can simply declare event listeners in a differently scoped bean:
ja_jp: または、必ずしもトランザクション中に状態を保持する必要がなく、トランザクションの開始/終了イベントに反応したいだけであれば、別のスコープを持つBeanでイベントリスナーを宣言すればよいでしょう。

source: Alternatively, if you need to specify specific properties when running tests against the native executable built using the `prod` profile, an option is to put those properties in file `src/test/resources/application-nativeit.yaml`, and refer to it from the `failsafe` plugin configuration using the `QUARKUS_CONFIG_LOCATIONS` environment variable. For instance:
ja_jp: または、ネイティブ実行可能ファイルに対してテストを実行するときに、 `prod` プロファイルを使用してビルドされた特定のプロパティーを指定する必要があれば、オプションとして、これらのプロパティーを `src/test/resources/application-nativeit.yaml` ファイルに配置し、 `QUARKUS_CONFIG_LOCATIONS` 環境変数を使用して `failsafe` プラグイン設定から参照できます。以下はその例です。
